Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/health/health_services/health_services_for_older_people/index.html.txt.tmx
Source language: en
Languages: ga

source: Health services for older people
ga: Seirbhísí sláinte do sheanóirí

source: Life Event Document Moving from home to long-term care Most older and young chronically sick people can continue to live at home with HSE and family support
ga: Life Event Document Ag bogadh ón mbaile go cúram fadtéarmach Is féidir le formhór na ndaoine aosta agus na ndaoine óga atá breoite go hainsealach leanúint ar aghaidh ag maireachtáil sa bhaile le tacaíocht ón FSS agus óna dteaghlaigh

source: Information on issues around moving from home to long stay care, should it become necessary or desirable
ga: Faisnéis maidir le bogadh ón mbaile go cúram fadchónaithe, dá mbeadh sé riachtanach nó inmhianaithe

source: Life Event Document Illness in your retirement There are a range of payments and services available to support older people who become ill or acquire a disability
ga: Life Event Document Breoiteacht agus tú imithe ar scor Tá raon d’íocaíochtaí agus sheirbhísí ar fáil in Éirinn chun tacaíocht a thabhairt do dhaoine aosta a éiríonn tinn nó a thiteann faoi mhíchumas

source: Information on income supports, health care, housing, taxation and caring for someone else
ga: Eolas maidir le tacaíochtaí ioncaim, cúram sláinte, tithíocht, cánachas agus cúram a thabhairt do dhuine eile

source: Nursing Homes Support Scheme
ga: An Scéim Tacaíochta do Thithe Altranais

source: People who move into registered nursing homes may receive financial support from the HSE under the Nursing Homes Support Scheme
ga: Má bhogann daoine chuig tithe altranais cláraithe, d'fhéadfadh siad tacaíocht airgeadais faoin Scéim Tacaíochta do Thithe Altranais ón FSS a fháil

source: Regulation of residential care for older people
ga: Rialú cúraim chónaithe do dhaoine scothaosta

source: National quality standards are enforced in both public and private nursing homes by HIQA, the Health Information and Quality Authority
ga: Cuireann an tÚdarás um Cháilíocht agus Eolas Sláinte (ÚCES) caighdeáin náisiúnta cáilíochta i bhfeidhm i dtithe altranais idir phríobháideach agus phoiblí

source: Inspection reports are available from them
ga: Is féidir tuarascálacha faoi na cigireachtaí a fháil uathu

source: The Home Care Support Scheme (or Home Care Package Scheme) is operated by the HSE
ga: Tá an Scéim Tacaíochta Cúram Baile (ar a dtugtar An Pacáiste Tacaíochta Cúram Baile freisin) á oibriú ag FSS

source: This Scheme aims to support people at risk of long-term care to remain living in the community
ga: Is é aidhm an scéim tacaíocht a thabhairt do dhaoine atá i mbaol cúraim fadtéarmach chun cur ar a gcumas cónaí sa phobal go neamhspleách

source: Some Health Service Executive (HSE) Areas in Ireland operate a scheme where older people are boarded out in private homes. Find out about the rules that apply to these arrangements and how to apply
ga: Ta rialacha a bhaineann le socruithe na Limistéir Fheidhmeannacht na Seirbhíse Sláinte i gcomhair lóistín sheachtrach do dhaoine aosta in Eireann

source: Tax relief on nursing home fees and for dependent relatives
ga: Faoiseamh Cánach ar Tháillí Tithe Altranais agus ar son Gaolta

source: Tax relief is available on fees paid for nursing homes and for dependent relatives
ga: Tá cur síos anseo ar an bhfaoiseamh cánach atá ar fáil ar tháillí tithe altranais agus ar son gaolta cleithiúnacha

source: Information on tax credits and how to apply for tax relief
ga: Faisnéis maidir le creidmheas cánach agus conas iarratas a dhéanamh ar fhaoiseamh cánach

source: This scheme closed to new applicants from 27 October 2009
ga: Tá an scéim seo dúnta d'iarratasóirí nua ó 27 Meán Fómhair 2009

source: Most Read in "Health"
ga: Ábhar is mó éilimh i "Sláinte"

source: Admission to a psychiatric hospital
ga: Ospidéal síciatrach a iontráil

source: Medical card means test: aged under 70
ga: Tástáil mhaoine cárta leighis: daoine faoi bhun 70 bliain d’aois
